__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 1, 128, 128)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 128, 128) 416         input_1[0][0]                    
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 16, 128, 128) 262144      conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 32)   51232       p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 32, 32, 32)   32768       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 4, 4)    3277056     p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 32)   0           p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 96, 4, 4)     1228896     p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 4, 4)     819264      p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 512, 4, 4)    1180160     conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 4, 4)     409632      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 4, 4)    307328      conv2d_6[0][0]                   
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 1, 32, 32, 30 0                                            
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, 64, 4, 4)     1024        conv2d_3[0][0]                   
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, 512, 4, 4)    8192        conv2d_5[0][0]                   
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, 32, 4, 4)     512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, 128, 4, 4)    2048        conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 32, 4, 4, 2)  384032      input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 736, 4, 4)    0           p_re_lu_3[0][0]                  
                                                                 p_re_lu_4[0][0]                  
                                                                 p_re_lu_6[0][0]                  
                                                                 p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 32, 4, 4, 2)  1024        conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 256, 4, 4)    3014912     concatenate_1[0][0]              
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 32, 4, 4, 2)  27680       p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 256, 4, 4)    4096        conv2d_9[0][0]                   
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, 32, 4, 4, 2)  1024        conv3d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 4096)         0           p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1024)         0           p_re_lu_9[0][0]                  
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 30720)        0           input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 35840)        0           flatten_1[0][0]                  
                                                                 flatten_2[0][0]                  
                                                                 flatten_3[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 35840)        0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 3)            107523      dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 3)            0           dense_1[0][0]                    
==================================================================================================
Total params: 11,120,963
Trainable params: 11,120,963
Non-trainable params: 0
__________________________________________________________________________________________________
