__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 1, 128, 128)  0                                            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 128, 128) 416         input_3[0][0]                    
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, 16, 128, 128) 262144      conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 32)   51232       p_re_lu_10[0][0]                 
__________________________________________________________________________________________________
p_re_lu_11 (PReLU)              (None, 32, 32, 32)   32768       conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 256, 4, 4)    3277056     p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 32)   0           p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 96, 4, 4)     1228896     p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 4, 4)     819264      p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 512, 4, 4)    1180160     conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 4, 4)     409632      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 4, 4)    307328      conv2d_15[0][0]                  
__________________________________________________________________________________________________
input_4 (InputLayer)            (None, 1, 32, 32, 30 0                                            
__________________________________________________________________________________________________
p_re_lu_12 (PReLU)              (None, 64, 4, 4)     1024        conv2d_12[0][0]                  
__________________________________________________________________________________________________
p_re_lu_13 (PReLU)              (None, 512, 4, 4)    8192        conv2d_14[0][0]                  
__________________________________________________________________________________________________
p_re_lu_15 (PReLU)              (None, 32, 4, 4)     512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
p_re_lu_14 (PReLU)              (None, 128, 4, 4)    2048        conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 32, 4, 4, 2)  384032      input_4[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 736, 4, 4)    0           p_re_lu_12[0][0]                 
                                                                 p_re_lu_13[0][0]                 
                                                                 p_re_lu_15[0][0]                 
                                                                 p_re_lu_14[0][0]                 
__________________________________________________________________________________________________
p_re_lu_17 (PReLU)              (None, 32, 4, 4, 2)  1024        conv3d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 256, 4, 4)    3014912     concatenate_3[0][0]              
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 32, 4, 4, 2)  27680       p_re_lu_17[0][0]                 
__________________________________________________________________________________________________
p_re_lu_16 (PReLU)              (None, 256, 4, 4)    4096        conv2d_18[0][0]                  
__________________________________________________________________________________________________
p_re_lu_18 (PReLU)              (None, 32, 4, 4, 2)  1024        conv3d_4[0][0]                   
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 4096)         0           p_re_lu_16[0][0]                 
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 1024)         0           p_re_lu_18[0][0]                 
__________________________________________________________________________________________________
flatten_6 (Flatten)             (None, 30720)        0           input_4[0][0]                    
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 35840)        0           flatten_4[0][0]                  
                                                                 flatten_5[0][0]                  
                                                                 flatten_6[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 35840)        0           concatenate_4[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 3)            107523      dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 3)            0           dense_2[0][0]                    
==================================================================================================
Total params: 11,120,963
Trainable params: 11,120,963
Non-trainable params: 0
__________________________________________________________________________________________________
